"===============строки=============="
#строки - это неизменяемые типы данныхб которые предназначены для хранения текста заключенного в одинарные или двойные ковычки


str_ = 'строки с одинарными кавычками'
str2 = "строки с двойными кавычками"

# error_string - 'неправильная строка'

str3 = 'fsef'




name = 'иса'
last_name = 'боржоев'
full_name = name + last_name
print(full_name)
print('иса'  )



"====================экранихация строк================="
# '\n' - переносит на новую строку
print('hello\nworld')




# '\'' - отображение '
# "\"' - отображение ""


# \v - перенос на новую строку со смпщением вправо на длину преыдущец строки
print('hello\vworld\vmy\vname')

# \r - отвечает за перенос каретки а начало строки
print('hello\rhhdhdhhd')







"===============форматирование строк==================="

title = 'iphone 15'
price = 1000
print(f'название: {title}\nцена: {price}')


format



"=================методы строк+++++++++++++++++++++++++++"
# методы - это функции которые относятся





print('hello world'.title()) #переводит первую букву каждого слова в верхний решистр


print('hello world'.capitalaze()) #переводит только первую букву первого слова в верхний регистр остальные слова остаются неизменными



print('hello'.center(11, '-'))


print('world'.count("w")) # возвращает количество вхождение заданного символа

print('hello'.startswith('h')) #false

print('hello'.endswith('1o')) #true






# .join('-'.join({'hello', 'world', 'my')




"==================инжексы=========="
# индукс - порядковый номер в последовательности (символа в строке) индексация начинается )

stringl1 = 'hello world'


"============================"



